tutorials/lagrangian/sprayFoam/aachenBomb/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-10 0 -10)
    (-10 0 10)
    (10 0 10)
    (10 0 -10)
    (-10 100 -10)
    (-10 100 10)
    (10 100 10)
    (10 100 -10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (41 41 100) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall walls
    (
        (2 6 5 1)
        (0 4 7 3)
        (0 1 5 4)
        (4 5 6 7)
        (7 6 2 3)
        (3 2 1 0)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
